from Merge_Intervals import *

# ========== Примеры вывода в консоль. ==========

# Точка входа в программу.
if __name__ == "__main__":

    # Создаём экземпляр класса.
    sol = Solution()

    # Пример 1.
    print('Вход: [1, 3], [2, 6], [8, 10], [15, 18]')
    print('Выход:', sol.merge([[1, 3], [2, 6], [8, 10], [15, 18]]))  # Ожидаем: [[1, 6], [8, 10], [15, 18]]
    print()

    # Пример 2.
    print('Вход: [1, 4], [4, 5]')
    print('Выход:', sol.merge([[1, 4], [4, 5]]))                     # Ожидаем: [[1, 5]]
    print()

    # Пример 3.
    print('Вход: [4, 7], [1, 4]')
    print('Выход:', sol.merge([[4, 7], [1, 4]]))                     # Ожидаем: [[1, 7]]