# ------------------ ПРИМЕРЫ ------------------

# Пример 1 (Вариант 2 - с правым средним элементом).
print("Пример:")
print("nums = [-10, -3, 0, 5, 9]")
print()
print("        0        ← середина.")
print("       / \\")
print("     -3   5")
print("    /      \\")
print("  -10       9")
print()

# Пример 2.
print("Пример:")
print("nums = [1, 3]")
print()
print("    3        ← середина (или 1, допустимы оба варианта).")
print("   /")
print("  1")
print()
print("или")
print()
print("    1")
print("     \\")
print("      3")