from Permutations import Solution

# Как это работает на примере [1,2,3] ?

# Шаг 1:
# path = []
# remaining = [1,2,3]

# Выбираем 1:
# path = [1]
# remaining = [2,3]

# Выбираем 2:
# path = [1,2]
# remaining = [3]

# Выбираем 3:
# path = [1,2,3]
# remaining = []

# Потом:
# * [1,3,2]
# * [2,1,3]
# * [2,3,1]
# * [3,1,2]
# * [3,2,1]

# Этот алгоритм:
# 1) перебирает все возможные варианты,
# 2) использует рекурсию + backtracking,
# 3) на каждом шаге:
#   - выбирает число,
#   - уменьшает список доступных,
#   - идёт дальше.

# ---------------------------------------------------

# Примеры вывода в консоль.
sol = Solution() # Заводим объект класса Solution.

print("Пример 1:")
print(sol.permute([1, 2, 3]))

print("\nПример 2:")
print(sol.permute([0, 1]))

print("\nПример 3:")
print(sol.permute([1]))