from Generate_Parentheses import Solution

if __name__ == "__main__":
    solution = Solution()

    print("Тест для n = 1:")
    print(solution.generateParenthesis(1))
    print()

    # 1. Начинаем: current = "", open_count = 0, close_count = 0
    # 2. open_count < 1? ДА -> backtrack( "(", 1, 0 )
    # 3. close_count < open_count? ( 0 < 1 ) ДА -> backtrack ( "()", 1, 1)
    # 4. Длина строки = 2 (2*n) -> добавляем "()" в результат.

# ------------------------------------------------------------------------- #

    print("Тест для n = 2:")
    print(solution.generateParenthesis(2))
    print()

    # Объяснение первого варианта:
    # 1. "" -> "(" (open_count < 2)
    # 2. "(" -> "((" (open_count < 2)
    # 3. "((" -> "(()" (close_count < open_count, 0 < 2)
    # 4. "(()" -> "(())" (close_count < open_count, 1 < 2)
    # 5. Длина = 4 -> добавляем "(())".

    # Объяснение второго варианта:
    # 1. "" -> "(" (open_count < 2)
    # 2. "(" -> "()" (close_count < open_count, 0 < 1)
    # 3. "()" -> "()(" (open_count < 2, т.к. open_count = 1 < 2)
    # 4. "()(" -> "()()" (close_count < open_count, 1 < 2)
    # 5. Длина 4 -> добавляем "()()".

# ------------------------------------------------------------------------- #

    print("Тест для n = 3:")
    print(solution.generateParenthesis(3))

    # Результат: ['((()))', '(()())', '(())()', '()(())', '()()()']
    # 1. ((())):
    # "" → "(" → "((" → "(((" → "(()" → "((()" → "((())" → "((()))"

    # 2. (()()):
    # "" → "(" → "((" → "(()" → "(()(" → "(()()" → "(()())"

    # 3. (())():
    # "" → "(" → "((" → "(()" → "(())" → "(())(" → "(())()"

    # 4. ()(()):
    # "" → "(" → "()" → "()(" → "()((" → "()(()" → "()(())"

    # 5. ()()():
    # "" → "(" → "()" → "()(" → "()()" → "()()(" → "()()()"

# ------------------------------------------------------------------------- #