from Candy import *

# Примеры.
if __name__ == "__main__":
    sol = Solution()

    test_cases = [
        [1, 0, 2], # [2 + 1 + 2] = 5
        [1, 2, 2], # [1 + 2 + 1] = 4
        [1, 3, 4, 5, 2], # [1 + 2 + 3 + 4 + 1] = 11
        [1, 2, 3, 1, 0], # [1 + 2 + 3 + 2 + 1] = 9
        [5, 4, 3, 2, 1], # [5 + 4 + 3 + 2 + 1] = 15
        [1, 1, 1], # [1 + 1 + 1] = 3
        [] # [] = 0
    ]

    for ratings in test_cases:
        result = sol.candy(ratings)
        print(f"ratings = {ratings} -> candies = {result}")

# Разбор первой строчки: [1, 0, 2] // [2 + 1 + 2] = 5

# Каким образом в первой строчке получается 5 конфет?
# ratings = [1, 0, 2]

# Нужно:
# - у каждого ребёнка ≥ 1 конфеты
# - если рейтинг выше соседа - конфет больше.

# Шаг 1: начальное состояние.
# candies: [1, 1, 1]

# Шаг 2: проход слева направо.
# сравниваем с левым соседом:
# i = 1:
# ratings[1] = 0, ratings[0] = 1
# -> 0 НЕ больше 1 -> ничего не делаем
# i = 2:
# ratings[2] = 2, ratings[1] = 0
# -> 2 > 0 -> увеличиваем.

# candies[2] = candies[1] + 1 = 2

# Теперь:
# candies = [1, 1, 2]

# Шаг 3: проход справа налево
# сравниваем с правым соседом:
# i = 1:
# ratings[1] = 0, ratings[2] = 2
# -> 0 НЕ больше 2 -> ничего
# i = 0:
# ratings[0] = 1, ratings[1] = 0
# -> 1 > 0 -> нужно больше конфет, чем у соседа справа.

# candies[0] = max(1, candies[1] + 1) = 2

# Теперь:
# candies = [2, 1, 2]

# Шаг 4: сумма.
# 2 + 1 + 2  = 5

# [V] Итоговое распределение.
# Ребёнок   Рейтинг     Конфеты
# 0         1           2
# 1         0           1
# 2         2           2

# Средний имеет минимальный рейтинг - 1 конфета.
# Оба соседа выше - получают по 2.